tests/performance/report/statistics.json
{
  "Delete Users" : {
    "transaction" : "Delete Users",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 343.30999999999983,
    "medianResTime" : 273.5,
    "minResTime" : 230.0,
    "maxResTime" : 1587.0,
    "pct1ResTime" : 421.30000000000007,
    "pct2ResTime" : 652.1499999999994,
    "pct3ResTime" : 1586.77,
    "throughput" : 1.0039253481111146,
    "receivedKBytesPerSec" : 0.5392177162706181,
    "sentKBytesPerSec" : 0.5390706568934535
  },
  "Create Post" : {
    "transaction" : "Create Post",
    "sampleCount" : 100,
    "errorCount" : 28,
    "errorPct" : 28.0,
    "meanResTime" : 38339.16999999999,
    "medianResTime" : 16144.5,
    "minResTime" : 3405.0,
    "maxResTime" : 110504.0,
    "pct1ResTime" : 93615.40000000001,
    "pct2ResTime" : 102399.49999999997,
    "pct3ResTime" : 110483.98999999999,
    "throughput" : 0.3615498920773572,
    "receivedKBytesPerSec" : 0.31164612084082044,
    "sentKBytesPerSec" : 0.973674337776179
  },
  "Register" : {
    "transaction" : "Register",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28723.05,
    "medianResTime" : 15586.5,
    "minResTime" : 1476.0,
    "maxResTime" : 104993.0,
    "pct1ResTime" : 83143.7,
    "pct2ResTime" : 93399.8,
    "pct3ResTime" : 104986.48,
    "throughput" : 0.492865768008083,
    "receivedKBytesPerSec" : 0.49416050327755734,
    "sentKBytesPerSec" : 0.19389262303161733
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 700,
    "errorCount" : 65,
    "errorPct" : 9.285714,
    "meanResTime" : 26411.190000000024,
    "medianResTime" : 11288.5,
    "minResTime" : 91.0,
    "maxResTime" : 339337.0,
    "pct1ResTime" : 84876.4,
    "pct2ResTime" : 93212.7999999999,
    "pct3ResTime" : 106588.49,
    "throughput" : 1.377120519685938,
    "receivedKBytesPerSec" : 65.27827148504743,
    "sentKBytesPerSec" : 1.4836782938263686
  },
  "Get All Posts" : {
    "transaction" : "Get All Posts",
    "sampleCount" : 100,
    "errorCount" : 1,
    "errorPct" : 1.0,
    "meanResTime" : 32982.89,
    "medianResTime" : 10513.0,
    "minResTime" : 1788.0,
    "maxResTime" : 339337.0,
    "pct1ResTime" : 86804.5,
    "pct2ResTime" : 91751.19999999997,
    "pct3ResTime" : 337003.0699999988,
    "throughput" : 0.26671005150171095,
    "receivedKBytesPerSec" : 87.0166312678529,
    "sentKBytesPerSec" : 0.13566008820768177
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 37381.73,
    "medianResTime" : 13829.5,
    "minResTime" : 2398.0,
    "maxResTime" : 108104.0,
    "pct1ResTime" : 93960.80000000002,
    "pct2ResTime" : 102097.34999999998,
    "pct3ResTime" : 108094.45,
    "throughput" : 0.3917712369393264,
    "receivedKBytesPerSec" : 0.516701881187537,
    "sentKBytesPerSec" : 0.11742424613419732
  },
  "Add Comment To Post" : {
    "transaction" : "Add Comment To Post",
    "sampleCount" : 100,
    "errorCount" : 28,
    "errorPct" : 28.0,
    "meanResTime" : 23324.349999999995,
    "medianResTime" : 4111.5,
    "minResTime" : 91.0,
    "maxResTime" : 98956.0,
    "pct1ResTime" : 79084.6,
    "pct2ResTime" : 81605.99999999999,
    "pct3ResTime" : 98882.22999999997,
    "throughput" : 0.27174651485094703,
    "receivedKBytesPerSec" : 0.2757802521807658,
    "sentKBytesPerSec" : 0.16271087954156363
  },
  "Create Story" : {
    "transaction" : "Create Story",
    "sampleCount" : 100,
    "errorCount" : 8,
    "errorPct" : 8.0,
    "meanResTime" : 23783.830000000005,
    "medianResTime" : 11397.0,
    "minResTime" : 859.0,
    "maxResTime" : 106804.0,
    "pct1ResTime" : 82257.20000000001,
    "pct2ResTime" : 91635.59999999998,
    "pct3ResTime" : 106779.86999999998,
    "throughput" : 0.27917208725802756,
    "receivedKBytesPerSec" : 0.2287248186777293,
    "sentKBytesPerSec" : 0.7010272834880877
  }
}